# RevitLinkOperations Properties

---
The RevitLinkOperations type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from LinkOperations)
Top
#### Reference
RevitLinkOperations Class
Autodesk.Revit.DB Namespace